Repository: cricketthomas/AzureKeyVaultExplorer
Catalog: src/uno/AzureKeyVaultStudio/AzureKeyVaultStudio/Strings/*/Resources.resw
Source language: en
Languages: es, fr, pt_br

# PinToQuickAccessMenuFlyoutItem.Text
source: Pin to Quick Access
es: Fijar a Acceso rápido
fr: Épingler à l'accès rapide
pt_br: Fixar no acesso rápido

# UnPinToQuickAccessMenuFlyoutItem.Text
source: Remove From Quick Access
es: Quitar de Acceso rápido
fr: Supprimer de l'accès rapide
pt_br: Remover do acesso rápido

# OpenInAzureMenuFlyoutItem.Text
source: Open in Azure Portal
es: Abrir en portal de Azure
fr: Ouvrir dans le portail Azure
pt_br: Abrir no portal Azure

# PropertiesText
source: Properties
es: Propiedades
fr: Propriétés
pt_br: Propriedades

# NewItemButton.Content
source: New..
es: Nuevo..
fr: Nouveau..
pt_br: Novo..

# NewSecretButton.Text
source: Secret..
es: Secreto..
pt_br: Segredo..

# ItemDetailsOpenAppBarButton.Label
source: Open
es: Abrir
fr: Ouvrir
pt_br: Abrir

# ItemDetailsRefreshAppBarButton.Label
source: Refresh
es: Actualizar
fr: Actualiser
pt_br: Atualizar

# ItemDetailsCopyAppBarButton.Label
source: Copy
es: Copiar
fr: Copier
pt_br: Copiar

# ItemDetailsEditAppBarButton.Label
source: Edit
es: Editar
fr: Modifier
pt_br: Editar

# ItemDetailsNewVersionAppBarButton.Label
source: New Version
es: Nueva versión
fr: Nouvelle Version
pt_br: Nova versão

# ItemDetailsDownloadKeyAppBarButton.Label
source: Download Public Key
es: Descargar clave pública
fr: Télécharger la clé publique
pt_br: Baixar chave pública

# ItemDetailsDownloadCerAppBarButton.Label
source: Download CER
es: Descargar CER
fr: Télécharger le CER
pt_br: Baixar CER

# ItemDetailsDownloadPfxAppBarButton.Label
source: Download PFX/PEM
es: Descargar PFX/PEM
fr: Télécharger PFX/PEM
pt_br: Baixar PFX/PEM

source: New Secret
es: Nuevo Secreto
fr: Nouveau Secret
pt_br: Novo Secret

source: Copied
es: Copiado
fr: Copié
pt_br: Copiado

# SecretNotFoundMessage
source: A value was not found for '{0}'
es: No se encontró ningún valor para '{0}'.
fr: Aucune valeur n’a été trouvée pour '{0}'.
pt_br: Nenhum valor foi encontrado para '{0}'.

# InsufficientPrivilegesMessage
source: Insufficient Privileges to access '{}'
es: Privilegios insuficientes para acceder a '{}'.
fr: Privilèges insuffisants pour accéder à '{}'
pt_br: Privilégios insuficientes para acessar '{}'

# CancelButtonTextBlock.Text
source: Cancel
es: Cancelar
fr: Annuler
pt_br: Cancelar

# ItemsText
source: items
es: elementos
fr: éléments
pt_br: itens

# ItemText
source: item
es: elemento
fr: élément

# DataGridTextColumnName.Header
source: Name
es: Nombre
fr: Nom
pt_br: Nome

# DataGridTextColumnWhenLastModified.Header
source: Last Modified
es: Modificado
fr: Modifié
pt_br: Modificado

# DataGridTextColumnWhenExpires.Header
source: Expires
es: Expira
fr: Expire
pt_br: Expira

# DataGridTextColumnTags.Header
source: Tags
es: Etiquetas
fr: Étiquettes

# DataGridTextColumnUpdated.Header
source: Updated
es: Actualizado
fr: Mis à jour
pt_br: Atualizado

# DataGridTextColumnContentType.Header
source: Content Type
es: Tipo de contenido
fr: Type de contenu
pt_br: Tipo de conteúdo

# QuickAccessText
source: Quick Access
es: Acceso rápido
fr: Accès rapide
pt_br: Acesso rápido

# DataGridTextColumnVersions.Header
source: Version
es: Versión
pt_br: Versão

# SendFeedbackHyperlinkButton.Content
source: Send feedback
es: Enviar comentarios
fr: Envoyer des retours
pt_br: Enviar feedback

# DataGridTextSubscriptionId.Header
source: Subscription Id
es: Suscripción Id
fr: Abonnement Id
pt_br: Assinatura Id

# DataGridTextState.Header
source: State
es: Estado
fr: État
pt_br: Estado

# SignOutMessage
source: You have been signed out.
es: Has sido desconectado.
fr: Vous avez été déconnecté.
pt_br: Você foi desconectado.

# AccountTextBlock.Text
source: Account
es: Cuenta
fr: Compte
pt_br: Conta

# AppearanceTextBlock.Text
source: Appearance
es: Apariencia
fr: Apparence
pt_br: Aparência

# AboutTextBlock.Text
source: About
es: Acerca de
fr: À propos
pt_br: Sobre

# AdvancedAccountTextBlock.Text
source: Advanced Account
es: Cuenta avanzada
fr: Compte avancé
pt_br: Conta avançada

# AzureCloudInstanceSettingsTextBlock.Text
source: Changing this setting will sign you out and require the application to restart.
es: Cambiar esta configuración cerrará su sesión y requerirá reiniciar la aplicación.
fr: La modification de ce paramètre vous déconnectera et nécessitera le redémarrage de l’application.
pt_br: Alterar esta configuração encerrará sua sessão e exigirá reiniciar o aplicativo.

# SplitButtonTeachingTip.Title
source: Main Menu
es: Menú principal
fr: Menu principal
pt_br: Menu principal

# SplitButtonTeachingTip.Subtitle
source: Use this button to open or close the navigation pane, access Settings, and launch other tools or features.
es: Use este botón para abrir o cerrar el panel de navegación, acceder a Configuración y abrir otras herramientas o funciones.
fr: Utilisez ce bouton pour ouvrir ou fermer le volet de navigation, accéder aux Paramètres et lancer d'autres outils ou fonctionnalités.
pt_br: Use este botão para abrir ou fechar o painel de navegação, acessar Configurações e abrir outras ferramentas ou recursos.

# ShowErrorsButton.Content
source: Show errors
es: Mostrar errores
fr: Afficher les erreurs
pt_br: Mostrar erros

# NewItemTextBlock.Text
source: Create Secret
es: Crear secreto
fr: Créer un secret
pt_br: Criar segredo

# SecretNameTextBlock.Text
source: Secret Name
es: Nombre del secreto
fr: Nom du secret
pt_br: Nome do segredo

# VaultLocationTextBlock.Text
source: Vault Location
es: Ubicación del almacén
fr: Emplacement du coffre
pt_br: Localização do cofre

# SecretValueTextBlock.Text
source: Secret Value
es: Valor del secreto
fr: Valeur du secret
pt_br: Valor do segredo

# SecretContentTypeTextBlock.Text
source: Secret Content Type (optional)
es: Tipo de contenido del secreto (opcional)
fr: Type de contenu du secret (facultatif)
pt_br: Tipo de conteúdo do segredo (opcional)

# EnabledTextBlock.Text
source: Enabled
es: Habilitado
fr: Activé
pt_br: Habilitado

# EnabledToggleSwitch.OnContent
source: Yes
es: Sí
fr: Oui
pt_br: Sim

# ShowToggleButton.ToolTipService.ToolTip
source: Toggle Value Visibility
es: Alternar visibilidad del valor
fr: Basculer la visibilité de la valeur
pt_br: Alternar visibilidade do valor

# ClipboardTextBlock.Text
source: Clipboard
es: Portapapeles
fr: Presse-papiers
pt_br: Área de transferência

# ApplicationResetMessage
source: Application has been reset. Please exit the app.
es: La aplicación ha sido restablecida. Por favor, cierre la aplicación.
fr: L’application a été réinitialisée. Veuillez quitter l’application.
pt_br: O aplicativo foi redefinido. Por favor, feche o aplicativo.

# DatabseDeletedMessage
source: Database deleted. Restart the app to recreate the database.
es: La base de datos ha sido eliminada. Reinicie la aplicación para recrear la base de datos.
fr: La base de données a été supprimée. Redémarrez l’application pour recréer la base de données.
pt_br: O banco de dados foi excluído. Reinicie o aplicativo para recriar o banco de dados.

# SavedChangesMessage
source: Your changes have been saved.
es: Sus cambios han sido guardados.
fr: Vos modifications ont été enregistrées.
pt_br: Suas alterações foram salvas.

# NewItemErrorTitle
source: Error
fr: Erreur
pt_br: Erro

# FailureInfoBar.Title
source: Error
fr: Erreur
pt_br: Erro

# EnabledToggleSwitch.OffContent
source: No
fr: Non
pt_br: Não
